HTML 規範
1.	縮排使用四個空格或 1個Tab縮排 (決定後請全站相同規則)。HTML標籤所有屬性名和值如無固定標準形式應皆為小寫，並以 – 做為分隔符號。並使用雙引號。
 
2.	開放式標籤不加結尾 /
 
3.	封閉式標籤請確實有關閉標籤。
4.	所有 HTML 文件必須加上 DOCTYPE(大寫) HTML5文檔宣告。
 
5.	HTML 標籤應加上 lang 屬性，以利語音以及翻譯工具運作。
6.	一般狀況下請用 UTF-8 編碼方式編碼。
7.	<script><link> 不需要 type 屬性。
8.	HTML 標籤內不應該含有事件與樣式的綁定 Ex : onclick, style，這些東西必須在css文檔或是javascript文檔內。
9.	非必要的css 和 javascript 不應該寫在HTML文檔內，應將這些程式碼抽出至.css file or .js file，再將其引用之。
10.	css 檔案一律在 head引用，js檔案一律在文檔之後引用，以增加效能。
11.	HTML TAG 必須語意化，避免使用大量的 div做無語意切版。並且必須使用適當的標籤。
12.	為避免JS 使用的 className 跟 css使用的ClassName混用，js 使用的className 請用 j- 開頭。
13.	避免使用樣式性標籤 <b>, <str>, <i>, <del> ……等等。這些樣式應該在CSS裡定義。
14.	RWD盡可能一個HTML架構框架下呈現。
15.	引用的JS, CSS檔案必須都是要壓縮過的。( 必要時 JSON, XML都可以做壓縮 )
16.	Cookie, localstorage, sessionStorage …等前端暫存記憶體不應該存入敏感資訊。
 
CSS 規範
1.	縮排使用四個空格或 1個Tab縮排 (決定後請全站相同規則)。
2.	CSS 編寫順序應跟隨HTML架構。
( 共用 => head => content => footer => media query)
3.	每個樣式後面都必須加上分號。
4.	CSS編寫風格應為一行。
 
當樣式比較多時，可使用多行編寫。
 
5.	選擇器、樣式屬性、樣式值都應該為小寫。
6.	!important 非必要應少使用。
7.	* 避免使用。
8.	屬性值能簡寫就簡寫，且 0 不用指明單位。
9.	多個選擇器共用樣式時，應獨立一行。
 
10.	字串符以單引號為主。
11.	注意效能，不可使用無意義標籤繼承 ( 避免使用以下 )
 
12.	請使用Css-sprite
 
Javascript 規範
1.	縮排使用四個空格或 1個Tab縮排 (決定後請全站相同規則)。
2.	分號、空格、換行暫不定義，請以清楚顯示為基準。
3.	引號最外層以單引號為主。
4.	駝峰式命名方式。
5.	部分縮寫可用全大寫。Ex : testID, testURL
6.	常數為全大寫 Ex : PI
7.	建構式第一字母大寫 Ex : Person()
8.	Jquery 物件變數請以 $ 開頭。 $dom
9.	私有方法請用 _開頭為變數名。
10.	避免使用全域變數
11.	請使用 ES6語法，如需支援低版本IE，請用webpack之類相關套件編譯成ES5語法。
12.	避免使用var 改用 const & let。
13.	請勿使用 new 建立物件、數值、字串…...等等基本物件。
 
14.	 短字串相加(含變數)，請用以下方式
 
15.	請用 . 取得物件內部的屬性或值
 
16.	避免使用eval() & with(){}

17.	請勿改寫預設物件的屬性及方法。
 
18.	函式註解方式應表達清楚，最基本範例如下
 
19.	所有套件都應該一致。不應該同一個功能使用不同的套件。如有使用 Client FrameWork應該優先使用FrameWorks相關套件。漸漸捨棄 Jquery 套件。
20.	優先使用強型別之判斷方式 Ex : === , !== 
21.	避免Hover , mouseleave ……等等事件，保持行動，桌機版行為一致。
22.	CSS為主，Javascript為輔，能用CSS做出來的效果，請優先使用CSS。
23.	重複使用的物件請用變數存放，勿重複創造物件。
 
